{"keras_version": "2.0.6", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_31", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "batch_input_shape": [null, 512, 512, 3], "dilation_rate": [1, 1], "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "relu", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_31", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "relu", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_32", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_33", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "relu", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_33", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_34", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "relu", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_34", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_35", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "relu", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_35", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_36", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "relu", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_36", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_37", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "relu", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_37", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_38", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "relu", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_38", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "units": 256, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "units": 256, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "units": 256, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.25, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "units": 5, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "softmax"}}], "backend": "tensorflow"}